In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.DataFrame(
    {
        'A': [1000, 765, 800],
        'B': [10, 5, 7],
        'C': [0.5, 0.35, 0.09],
    }
)

In [3]:
df

      A   B     C
0  1000  10  0.50
1   765   5  0.35
2   800   7  0.09

In [4]:
df.mean()

A    855.000000
B      7.333333
C      0.313333
dtype: float64

In [5]:
df - df.mean()

       A         B         C
0  145.0  2.666667  0.186667
1  -90.0 -2.333333  0.036667
2  -55.0 -0.333333 -0.223333

In [6]:
df.std()

A    126.787223
B      2.516611
C      0.207445
dtype: float64

In [7]:
normalized_df = (df - df.mean()) / df.std()

In [8]:
normalized_df

          A         B         C
0  1.143648  1.059626  0.899838
1 -0.709851 -0.927173  0.176754
2 -0.433798 -0.132453 -1.076592

In [9]:
df.max() - df.min()

A    235.00
B      5.00
C      0.41
dtype: float64

In [10]:
normalized_df = (df - df.min()) / (df.max() - df.min())

In [11]:
normalized_df

          A    B         C
0  1.000000  1.0  1.000000
1  0.000000  0.0  0.634146
2  0.148936  0.4  0.000000

In [13]:
normalized_df = (df - df.min()) / (df.max() - df.min())

In [14]:
normalized_df

          A    B         C
0  1.000000  1.0  1.000000
1  0.000000  0.0  0.634146
2  0.148936  0.4  0.000000

In [15]:
def normalize(df):
    result = df.copy()
    for feature_name in df.columns:
        max_value = df[feature_name].max()
        min_value = df[feature_name].min()
        result[feature_name] = (df[feature_name] - min_value) / (max_value - min_value)
    return result

In [16]:
normalized_df = normalize(df)

In [17]:
normalized_df

          A    B         C
0  1.000000  1.0  1.000000
1  0.000000  0.0  0.634146
2  0.148936  0.4  0.000000